app/controllers/store_controller.rb

  def add_to_cart
    # Diese Variable product ist unabhängig von der id-Bezeichung von button_to aus index.html
    product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 8)